/**
 * 时间线
 * 2014
 * 第一回：两个青年的相遇
 * 第二回：表白——我喜欢你，怎么办
 * 第三回：昭告天下——
 * 第四回：庆祝高考——有趣的场景——美好的恋爱
 * 第五回：大学——异地恋的开端
 * 第六回：你的生日——我们一起吃完整个蛋糕
 * 第七回：我的生日——时空交错的惊喜
 * 第八回：第一个寒假——热干面、锅盔完美的早餐——武汉
 * 2015
 * 第九回：第一个暑假——椰子、清补凉那南边的海岛——海南
 * 2016
 * 第十回：痛苦的分别
 * 2017
 * 第十一回：两种生活
 * 2018
 * 第十二回：你的名字
 * 2019
 * 第十三回：再次告白
 * 第十四回：重逢——多年未见的激动
 * 第十五回：飞向你的城市——结束了多年的异地
 * 第十六回：我们的小窝
 * 第十七回：许多第一次
 * 第十八回：JOJO的到来
 * 2020
 * 第十九回：被疫情分隔的我们
 * 第二十回：告别2019——期待2020
 */
export const memory = [
  {
    year: '2020',
    timeline: [
      {
        id: 23,
        name: '第23话',
        title: '锁颖的小宇宙，这是给你的礼物',
        time: '2020年5月20日',
        words: ['今天是一个新起点', '我们的二人世界再次回归！', '520 快乐'],
        song: {
          id: '',
          name: ''
        },
        img: []
      },
      {
        id: 22,
        name: '第22话',
        title: '小小的心思、大大的委屈',
        time: '2020年5月8日',
        words: ['很快就会过去', '谁都不能侵占我们的二人世界'],
        song: {
          id: '',
          name: ''
        },
        img: []
      },
      {
        id: 21,
        name: '第21话',
        title: '回到杭州，重新开始',
        time: '2020年3月24',
        words: ['我爱你，笨蛋颖', '永远爱你'],
        song: {
          id: '',
          name: ''
        },
        img: []
      },
      {
        id: 20,
        name: '第20话',
        title: '告别2019——期待2020',
        time: '2020年那个元宵',
        words: ['我爱你，笨蛋颖', '永远爱你'],
        song: {
          id: '',
          name: ''
        },
        img: []
      },
      { id: 19, name: '第19话', title: '被疫情分隔的我们', time: '2020-02-01', words: ['你好呀'], img: [] }
    ]
  },
  {
    year: '2019',
    timeline: [
      { id: 17, name: '第18话', title: '三亚风光好', time: '2019-10-01', words: ['你好呀'], img: [] },
      { id: 18, name: '第17话', title: 'JOJO的到来', time: '2019-09-24', words: ['我爱你，笨蛋颖', '永远爱你'], img: [] },
      { id: 16, name: '第16话', title: '我们的小窝', time: '2020年那个元宵', words: ['我爱你，笨蛋颖', '永远爱你'], img: [] },
      { id: 15, name: '第15话', title: '飞向你的城市——结束了多年的异地', time: '2020-02-01', words: ['你好呀'], img: [] },
      { id: 14, name: '第14话', title: '重逢——多年未见的激动', time: '2020年那个元宵', words: ['我爱你，笨蛋颖', '永远爱你'], img: [] },
      { id: 13, name: '第13话', title: '再次告白', time: '2020-02-01', words: ['你好呀'], img: [] }
    ]
  },
  {
    year: '2018',
    timeline: [{ id: 12, name: '第12话', title: '你的名字', time: '2018-02-01', words: ['你好呀'], img: [] }]
  },
  {
    year: '2017',
    timeline: [{ id: 11, name: '第11话', title: '两种生活', time: '2017-06-08', words: ['你好呀'], img: [] }]
  },
  {
    year: '2016',
    timeline: [{ id: 10, name: '第10话', title: '痛苦的分别', time: '2016-08-01', words: ['你好呀'], img: [] }]
  },
  {
    year: '2015',
    timeline: [{ id: 9, name: '第9话', title: '椰子、清补凉那南边的海岛——海南', time: '大学第一个暑假', words: [], img: [] }]
  },
  {
    year: '2014',
    timeline: [
      { id: 8, name: '第8话', title: '热干面、锅盔完美的早餐——武汉', time: '大学第一个寒假', words: [], img: [] },
      { id: 7, name: '第7话', title: '我的生日——时空交错的惊喜', time: '2015年那个初夏', words: [], img: [] },
      { id: 6, name: '第6话', title: '你的生日——我们一起吃完整个蛋糕', time: '2015年那个初夏', words: [], img: [] },
      { id: 5, name: '第5话', title: '大学——异地恋的开端', time: '2015年那个初夏', words: [], img: [] },
      { id: 4, name: '第4话', title: '庆祝高考——美好的恋爱', time: '2015年那个初夏', words: [], img: [] },
      { id: 3, name: '第3话', title: '昭告天下——', time: '2015年那个初夏', words: [], img: [] },
      { id: 2, name: '第2话', title: '表白——我喜欢你，怎么办', time: '2015年那个初夏', words: [], img: [] },
      { id: 1, name: '第1话', title: '少男少女的相遇', time: '2014年那个初夏', words: [], img: [] }
    ]
  }
]

export const memoryDays = [
  { time: '2014-07-12', name: '交往纪念日', desc: '', days: '', img: 'index/1' },
  { time: '1996-09-22', name: '笨蛋颖生日', desc: '', days: '', img: 'days/y' },
  { time: '1993-11-12', name: '邵锁生日', desc: '', days: '', img: 'days/s' },
  { time: '2019-09-15', name: 'jojo的生日', desc: '', days: '', img: 'index/2' },
  { time: '2020-02-14', name: '情人节', desc: '', days: '', img: 'index/2' },
  { time: '2020-08-14', name: '七夕节', desc: '', days: '', img: 'index/2' }
]
