/**
 * 时间线
 * 2014
 * 第一回：两个青年的相遇
 * 第二回：表白——我喜欢你，怎么办
 * 第三回：昭告天下——
 * 第四回：庆祝高考——有趣的场景——美好的恋爱
 * 第五回：大学——异地恋的开端
 * 第六回：你的生日——我们一起吃完整个蛋糕
 * 第七回：我的生日——时空交错的惊喜
 * 第八回：第一个寒假——热干面、锅盔完美的早餐——武汉
 * 2015
 * 第九回：第一个暑假——椰子、清补凉那南边的海岛——海南
 * 2016
 * 第十回：痛苦的分别
 * 2017
 * 第十一回：两种生活
 * 2018
 * 第十二回：你的名字
 * 2019
 * 第十三回：再次告白
 * 第十四回：重逢——多年未见的激动
 * 第十五回：飞向你的城市——结束了多年的异地
 * 第十六回：我们的小窝
 * 第十七回：许多第一次
 * 第十八回：JOJO的到来
 * 2020
 * 第十九回：被疫情分隔的我们
 * 第二十回：告别2019——期待2020
 */
export const memory = [
  {
    year: '2020',
    timeline: [
      {
        id: 20,
        name: '第20话',
        title: '告别2019——期待2020',
        time: '2020年那个元宵',
        words: ['我爱你，笨蛋颖', '永远爱你'],
        img: []
      },
      {
        id: 19,
        name: '第19话',
        title: '被疫情分隔的我们',
        time: '2020-02-01',
        words: ['你好呀'],
        img: []
      }
    ]
  },
  {
    year: '2019',
    timeline: [
      {
        id: 18,
        name: '第18话',
        title: 'JOJO的到来',
        time: '2020年那个元宵',
        words: ['我爱你，笨蛋颖', '永远爱你'],
        img: []
      },
      {
        id: 17,
        name: '第17话',
        title: '许多第一次',
        time: '2020-02-01',
        words: ['你好呀'],
        img: []
      },
      {
        id: 16,
        name: '第16话',
        title: '我们的小窝',
        time: '2020年那个元宵',
        words: ['我爱你，笨蛋颖', '永远爱你'],
        img: []
      },
      {
        id: 15,
        name: '第15话',
        title: '飞向你的城市——结束了多年的异地',
        time: '2020-02-01',
        words: ['你好呀'],
        img: []
      },
      {
        id: 14,
        name: '第14话',
        title: '重逢——多年未见的激动',
        time: '2020年那个元宵',
        words: ['我爱你，笨蛋颖', '永远爱你'],
        img: []
      },
      {
        id: 13,
        name: '第13话',
        title: '再次告白',
        time: '2020-02-01',
        words: ['你好呀'],
        img: []
      }
    ]
  },
  {
    year: '2018',
    timeline: [
      {
        id: 12,
        name: '第12话',
        title: '你的名字',
        time: '2020-02-01',
        words: ['你好呀'],
        img: []
      }
    ]
  },
  {
    year: '2017',
    timeline: [
      {
        id: 11,
        name: '第11话',
        title: '你的名字',
        time: '2020-02-01',
        words: ['你好呀'],
        img: []
      }
    ]
  },
  {
    year: '2016',
    timeline: [
      {
        title: '少年与少女的相遇',
        time: '2014年那个初夏',
        words: [],
        img: []
      },
      {
        title: '表白——我喜欢你，怎么办',
        time: '2014-06-08',
        words: [],
        img: []
      }
    ]
  },
  {
    year: '2015',
    timeline: [
      {
        title: '少年与少女的相遇',
        time: '2014年那个初夏',
        words: [],
        img: []
      },
      {
        title: '表白——我喜欢你，怎么办',
        time: '2014-06-08',
        words: [],
        img: []
      }
    ]
  },
  {
    year: '2014',
    timeline: [
      {
        title: '少年与少女的相遇',
        time: '2014年那个初夏',
        words: [],
        img: []
      },
      {
        title: '表白——我喜欢你，怎么办',
        time: '2014-06-08',
        words: [],
        img: []
      }
    ]
  }
]
